phil971-kant-rational-agency.org
#+TITLE: PHIL 971 - Kantian Conceptions of Rational Agency
#+DATE: July 2, 2020
#+AUTHOR: Colin McLear
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport archive nohugo
#+TODO: TODO NEXT | DONE CANCELED
#+TODO: DRAFT | DONE CANCELED
#+LANGUAGE: en
#+LATEX_HEADER: \usepackage[English]{babel}
#+OPTIONS: '":t

*** DONE Week 9 - Self-Consciousness I
SCHEDULED: <2020-10-13 Tue>
:PROPERTIES:
:EXPORT_HUGO_TAGS: agency identification alienation self-consciousness self-knowledge reflection
:EXPORT_FILE_NAME: week9
:END:

This week we will finish up our discussion of agent-causation from last week,
focusing on Velleman's functional and reductive account of agent-causation and
Franklin's "It Ain't Me" argument. We'll then turn to two recent arguments on the
relation between rationality and various forms of self-consciousness or
self-knowledge.

- [[/materials/handouts/9-kant-self-consciousness.pdf][Handout]] for week 9 

**** Readings

- Burge, "[[/materials/readings/burge-reason.pdf][Reason and the First Person]]"
- Boyle, "[[/materials/readings/boyle-active.pdf][Active Belief]]"
- (Optional) Burge, "[[/materials/readings/burge-self-knowledge.pdf][Our Entitlement to Self-Knowledge]]"
- (Optional) Boyle, "[[/materials/readings/boyle-making-mind.pdf][‘Making up Your Mind’ and the Activity of Reason]]"



