content/assignments/week9.md
+++
title = "Week 9 - Self-Consciousness I"
publishDate = 2020-10-13T00:00:00-04:00
tags = ["agency", "identification", "alienation", "self-consciousness", "self-knowledge", "reflection"]
draft = false
weight = -100
author = false
toc = false
type = "post"
+++

This week we will finish up our discussion of agent-causation from last week,
focusing on Velleman's functional and reductive account of agent-causation and
Franklin's "It Ain't Me" argument. We'll then turn to two recent arguments on the
relation between rationality and various forms of self-consciousness or
self-knowledge.

-   [Handout](/materials/handouts/9-kant-self-consciousness.pdf) for week 9


## Readings {#readings}

-   Burge, "[Reason and the First Person](/materials/readings/burge-reason.pdf)"
-   Boyle, "[Active Belief](/materials/readings/boyle-active.pdf)"
-   (Optional) Burge, "[Our Entitlement to Self-Knowledge](/materials/readings/burge-self-knowledge.pdf)"
-   (Optional) Boyle, "[‘Making up Your Mind’ and the Activity of Reason](/materials/readings/boyle-making-mind.pdf)"
